assignments/01/assign01.org
#+title: Assignment 1
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../style.css" />
#+OPTIONS: html-style:nil H:2 toc:nil todo:nil author:nil date:nil
#+HTML_LINK_HOME: ../../index.html
The following assignment is due *Thursday January 29 by 8:00 PM*.
Your solutions should be submitted via Gradescope as a single pdf.
They must be exceptionally neat (or typed) and the final answer in
your solution to each problem must be abundantly clear, e.g.,
surrounded in a box.  Also make sure to cite your sources per the
instructions in the course manual.

The problems are taken from the workbook /Problems and Exercises/
included in the course material based on version: [[file:~/Developer/Repositories/cs132/cs132-s26/workbook/v001.pdf][*v0.0.1*]]

These problems are based on problems that come from /Linear Algebra
and it's Applications/ by David C. Lay, Steven R. Lay, and Judi
J. McDonald.  As a reminder, we recommend this textbook as a source
for supplementary exercises.  The relevant sections for this
assignment are: *1.1, 1.2*.

*Basic Problems:* 1.3, 1.6, 1.7, 1.11, 1.16, 1.18, 1.23, 1.28, 1.29

*True/False:* 1.41, 1.45, 1.47, 1.49, 1.50, 1.54, 1.55, 1.56, 1.57

*More Difficult Problems:* 1.59, 1.60, 1.64

*Challenge Problems (Optional):* 1.74, 1.76
