assignments/01/assign01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-22 Thu 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 1</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="org-div-home-and-up">[<a href="../../index.html">back</a>]</div><div id="content" class="content">
<h1 class="title">Assignment 1</h1>
<p>
The following assignment is due <b>Thursday January 29 by 8:00 PM</b>.
Your solutions should be submitted via Gradescope as a single pdf.
They must be exceptionally neat (or typed) and the final answer in
your solution to each problem must be abundantly clear, e.g.,
surrounded in a box.  Also make sure to cite your sources per the
instructions in the course manual.
</p>

<p>
The problems are taken from the workbook <i>Problems and Exercises</i>
included in the course material based on version: <a href="file:///Users/NathanM/Developer/Repositories/cs132/cs132-s26/workbook/v001.pdf"><b>v0.0.1</b></a>
</p>

<p>
These problems are based on problems that come from <i>Linear Algebra
and it's Applications</i> by David C. Lay, Steven R. Lay, and Judi
J. McDonald.  As a reminder, we recommend this textbook as a source
for supplementary exercises.  The relevant sections for this
assignment are: <b>1.1, 1.2</b>.
</p>

<p>
<b>Basic Problems:</b> 1.3, 1.6, 1.7, 1.11, 1.16, 1.18, 1.23, 1.28, 1.29
</p>

<p>
<b>True/False:</b> 1.41, 1.45, 1.47, 1.49, 1.50, 1.54, 1.55, 1.56, 1.57
</p>

<p>
<b>More Difficult Problems:</b> 1.59, 1.60, 1.64
</p>

<p>
<b>Challenge Problems (Optional):</b> 1.74, 1.76
</p>
</div>
</body>
</html>
